contSpoilTurb3D/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;  // Enable castellated mesh generation
snap true;             // Enable snapping to STL surface
addLayers true;        //

// Geometry definition
geometry
{
    container
    {
        type triSurfaceMesh;
        file "Container.stl";
    }
	
	spoiler
    {
        type triSurfaceMesh;
        file "Spoiler.stl";
    }
 
	refinementBoxOuter
	{
		type searchableBox;
		// x-dimension is to start at incident recirculation zone
		// y-dimension is to start at ground
		min (-15 -8 -6);
		// x-dimension is to cover cavity region
		// y-dimension is to cover rotor and an additional 1.5 m above
		max (50 4 6);
	}
	
	refinementBoxInner
	{
		type searchableBox;
		// x-dimension is to start at incident recirculation zone
		// y-dimension is to start at ground
		min (-1 -8 -4);
		// x-dimension is to cover cavity region
		// y-dimension is to cover rotor and an additional 1.5 m above
		max (3.5 1 4);
	}
	
	turbine
    {
        type searchableCylinder;
        point1 (0 1.108456 -1.75);
        point2 (0 1.108456 1.75);
        radius 2;       
    }
}

// Castellated mesh controls
castellatedMeshControls
{
    locationInMesh (-1 0 0.5);
    maxLocalCells 100000;    // Limit the number of cells per processor
    maxGlobalCells 3000000;  // Limit the total number of cells
    minRefinementCells 10;   // Minimum number of cells to refine
    nCellsBetweenLevels 5;   // Smooth refinement between levels
	allowFreeStandingZoneFaces true;

    // Surface refinement
    features
    (
    {
		file "Container.eMesh";
		level 1;
	}
	{
		file "Spoiler.eMesh";
		level 2;
	}
    );

    refinementSurfaces
    {
        container
        {
            level (1 1);  // Minimum and maximum refinement levels
        }
		spoiler
        {
            level (1 2);  // Minimum and maximum refinement levels
        }
    }

    // Region refinement
    refinementRegions
    {
       refinementBoxOuter
       {
            mode inside;
            levels ((1e15 1)); 
       }
	   
       refinementBoxInner
       {
            mode inside;
            levels ((1e15 2)); 
       }
	   
	   turbine
	   {
			mode inside;
			levels ((1e15 2));
	   }

    }

    resolveFeatureAngle 30;  // Angle to detect sharp edges
	planarAngle 30;
	locationsOutsideMesh ((100 100 300));
}

// Snap controls
snapControls
{
	// Reommendations from meshing of NACA tutorial from Wolf Dynamics
	nSmoothPatch 10;
	tolerance 1.0;
	nSolveIter 100;
	nRelaxIter 10;
	nFeatureSnapIter 100;
 
	// Settings Needed for 2D
	implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
 
}

// Boundary Layers
addLayersControls
{
	relativeSizes yes;
 
	// Layer thickness specification. This can be specified in one of following
    // ways:
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness
    // - overall thickness and expansionRatio
 
	// Expansion factor for layer mesh
	// expansionRatio 1.2;
	expansionRatio 1.15;
 
	// Wanted thickness of the layer furthest away from the wall.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// finalLayerThickness 0.137;
	finalLayerThickness 0.4;
 
	// Wanted thickness of the layer next to the wall.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// firstLayerThickness 7.12e-5;
 
	// Wanted overall thickness of layers.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
    // thickness 0.5
 
	// Minimum overall thickness of total layers. If for any reason layer
    // cannot be above minThickness do not add layer.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// minThickness 0.00001;
	minThickness 0.2;
 
	layers
    {
/*
        container
        {
            nSurfaceLayers 10;
        }
		spoiler
        {
            nSurfaceLayers 25;
        }
		ground
		{
			nSurfaceLayers 10;
		}
*/
    }
 
	// If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
	nGrow 1;
 
	// Static analysis of starting mesh
 
	// When not to extrude surface. 0 is flat surface, 90 is when two faces
	// are perpendicular
	// featureAngle 130;
	featureAngle 180;
  
	// Stop layer growth on highly warped cells
	maxFaceThicknessRatio 0.5;
 
    // Patch displacement
 
	// Number of smoothing iterations of surface normals
	nSmoothSurfaceNormals 1;
  
	// Smooth layer thickness over surface patches
	nSmoothThickness 10;
  
	// Medial axis analysis
 
	// minMedianAxisAngle 90;
	minMedianAxisAngle 130;
	// minMedialAxisAngle 90;
	minMedialAxisAngle 80;
	
	// Reduce layer growth where ratio thickness to medial
	// distance is large
	maxThicknessToMedialRatio 0.6;
	
	// Number of smoothing iterations of interior mesh movement direction
	nSmoothNormals 3;
 
	// Mesh shrinking
 
	slipFeatureAngle 30;
	nRelaxIter 5;
	nRelaxedIter 10;
	// nLayerIter 50; //IMPORTANT - SET TO 1 TO DISABLE QUALITY CHECKS OF BL
	nLayerIter 80; 
	nBufferCellsNoExtrude 0;
  
	// Extra Controls
 
	concaveAngle 0;
	mergePatchFacesAngle 60;
	layerTerminationAngle -180;
}

// Mesh quality settings
meshQualityControls
{
	// Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 75;
 
	// Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 4;
    maxInternalSkewness 4;
 
	// Set to 180 to disable.
    maxConcave 80;
 
	//  Set to very negative number (e.g. -1E30) to disable.
	minVol 1e-13;
 
	// Minimum quality of the tet formed by the face-centre
	// and variable base point minimum decomposition triangles and
	// the cell centre. Set to very negative number (e.g. -1E30) to
	// disable.
	//    <0 = inside out tet,
	//     0 = flat tet
	//     1 = regular tet
	// 1e-15 (small positive) to enable tracking
	//-1e+30 (large negative) for best layer insertion
	minTetQuality -1e+30; 
 
	// Minimum face area. Set to <0 to disable.
	minArea -1;
	
	minTwist 0.02;
	
	minDeterminant 0.001;
	
	minFaceWeight 0.05;
	
	minVolRatio 0.01;
	
	minTriangleTwist -1;

    // Number of error distribution iterations
	errorReduction 0.75;
 
	// amount to scale back displacement at error points
	nSmoothScale 4;
}

// Advanced settings
debug 0;
mergeTolerance 1e-6;
