contSpoilTurb3D/constant/airfoils/NACA0018_1-6e5
// From Sheldahl and Klimas (1981)
// Re = 1.6e5
// (alpha_deg cl cd)
(-180 -0.0 0.025)
(-175 0.66 0.055)
(-170 0.85 0.14)
(-165 0.68 0.23)
(-160 0.635 0.32)
(-155 0.67 0.42)
(-150 0.77 0.575)
(-145 0.9 0.755)
(-140 0.98 0.925)
(-135 0.93 1.085)
(-130 0.85 1.225)
(-125 0.76 1.35)
(-120 0.67 1.465)
(-115 0.575 1.555)
(-110 0.45 1.635)
(-105 0.32 1.7)
(-100 0.185 1.75)
(-95 0.05 1.78)
(-90 -0.09 1.8)
(-85 -0.23 1.8)
(-80 -0.365 1.78)
(-75 -0.5 1.735)
(-70 -0.63 1.665)
(-65 -0.76 1.575)
(-60 -0.875 1.47)
(-55 -0.955 1.345)
(-50 -1.02 1.215)
(-45 -1.05 1.075)
(-40 -1.035 0.92)
(-35 -0.98 0.745)
(-30 -0.855 0.57)
(-25 -0.6321 0.405)
(-22 -0.5026 0.329)
(-20 -0.4382 0.282)
(-18 -0.4202 0.238)
(-16 -0.4896 0.196)
(-14 -0.6237 0.158)
(-13 -0.6923 0.077)
(-12 -0.7488 0.0288)
(-11 -0.7852 0.0262)
(-10 -0.7949 0.0238)
(-9 -0.7781 0.0217)
(-8 -0.7373 0.0198)
(-7 -0.6724 0.0181)
(-6 -0.596 0.0166)
(-5 -0.5068 0.0153)
(-4 -0.4114 0.0144)
(-3 -0.3088 0.0137)
(-2 -0.22 0.0131)
(-1 -0.11 0.0129)
(0 0.000 .0128)
(1 .1100 .0129)
(2 .2200 .0131)
(3 .3088 .0137)
(4 .4114 .0144)
(5 .5068 .0153)
(6 .5960 .0166)
(7 .6724 .0181)
(8 .7373 .0198)
(9 .7781 .0217)
(10 .7949 .0238)
(11 .7852 .0262)
(12 .7488 .0288)
(13 .6923 .0770)
(14 .6237 .1580)
(16 .4896 .1960)
(18 .4202 .2380)
(20 .4382 .2820)
(22 .5026 .3290)
(25 .6321 .4050)
(30 .8550 .5700)
(35 .9800 .7450)
(40 1.0350 .9200)
(45 1.0500 1.0750)
(50 1.0200 1.2150)
(55 .9550 1.3450)
(60 .8750 1.4700)
(65 .7600 1.5750)
(70 .6300 1.6650)
(75 .5000 1.7350)
(80 .3650 1.7800)
(85 .2300 1.8000)
(90 .0900 1.8000)
(95 -.05 1.7800)
(100 -.1850 1.7500)
(105 -.3200 1.7000)
(110 -.4500 1.6350)
(115 -.5750 1.5550)
(120 -.6700 1.4650)
(125 -.7600 1.3500)
(130 -.8500 1.2250)
(135 -.9300 1.0850)
(140 -.9800 .9250)
(145 -.9000 .7550)
(150 -.7700 .5750)
(155 -.6700 .4200)
(160 -.6350 .3200)
(165 -.6800 .2300)
(170 -.8500 .1400)
(175 -.6600 .0550)
(180 0.000 .0250)