contSpoilTurb3D/constant/airfoils/NACA0018_7e5
// From Sheldahl and Klimas (1981)
// Re = 7e5
// (alpha_deg cl cd)
(-180	0	0.0250000000000000)
(-175	0.660000000000000	0.0550000000000000)
(-170	0.850000000000000	0.140000000000000)
(-165	0.680000000000000	0.230000000000000)
(-160	0.635000000000000	0.320000000000000)
(-155	0.670000000000000	0.420000000000000)
(-150	0.770000000000000	0.575000000000000)
(-145	0.900000000000000	0.755000000000000)
(-140	0.980000000000000	0.925000000000000)
(-135	0.930000000000000	1.08500000000000)
(-130	0.850000000000000	1.22500000000000)
(-125	0.760000000000000	1.35000000000000)
(-120	0.670000000000000	1.46500000000000)
(-115	0.575000000000000	1.55500000000000)
(-110	0.450000000000000	1.63500000000000)
(-105	0.320000000000000	1.70000000000000)
(-100	0.185000000000000	1.75000000000000)
(-95	0.0500000000000000	1.78000000000000)
(-90	-0.0900000000000000	1.80000000000000)
(-85	-0.230000000000000	1.80000000000000)
(-80	-0.365000000000000	1.78000000000000)
(-75	-0.500000000000000	1.73500000000000)
(-70	-0.630000000000000	1.66500000000000)
(-65	-0.760000000000000	1.57500000000000)
(-60	-0.875000000000000	1.47000000000000)
(-55	-0.955000000000000	1.34500000000000)
(-50	-1.02000000000000	1.21500000000000)
(-45	-1.05000000000000	1.07500000000000)
(-40	-1.03500000000000	0.920000000000000)
(-35	-0.980000000000000	0.745000000000000)
(-30	-0.855000000000000	0.570000000000000)
(-25	-0.932600000000000	0.405000000000000)
(-22	-0.886700000000000	0.329000000000000)
(-20	-0.887700000000000	0.282000000000000)
(-18	-0.915000000000000	0.238000000000000)
(-16	-0.964800000000000	0.196000000000000)
(-15	-0.993800000000000	0.102000000000000)
(-14	-1.01750000000000	0.0245000000000000)
(-13	-1.02890000000000	0.0223000000000000)
(-12	-1.02450000000000	0.0202000000000000)
(-11	-0.997300000000000	0.0183000000000000)
(-10	-0.954100000000000	0.0166000000000000)
(-9	-0.890400000000000	0.0150000000000000)
(-8	-0.815600000000000	0.0136000000000000)
(-7	-0.729100000000000	0.0123000000000000)
(-6	-0.632800000000000	0.0112000000000000)
(-5	-0.550000000000000	0.0102000000000000)
(-4	-0.440000000000000	0.00960000000000000)
(-3	-0.330000000000000	0.00910000000000000)
(-2	-0.220000000000000	0.00880000000000000)
(-1	-0.110000000000000	0.00870000000000000)
(0 0.000 .0085)
(1 .1100 .0087)
(2 .2200 .0088)
(3 .3300 .0091)
(4 .4400 .0096)
(5 .5500 .0102)
(6 .6328 .0112)
(7 .7291 .0123)
(8 .8156 .0136)
(9 .8904 .0150)
(10 .9541 .0166)
(11 .9973 .0183)
(12 1.0245 .0202)
(13 1.0289 .0223)
(14 1.0175 .0245)
(15 .9938 .1020)
(16 .9648 .1960)
(18 .9150 .2380)
(20 .8877 .2820)
(22 .8867 .3290)
(25 .9326 .4050)
(30 .8550 .5700)
(35 .9800 .7450)
(40 1.0350 .9200)
(45 1.0500 1.0750)
(50 1.0200 1.2150)
(55 .9550 1.3450)
(60 .8750 1.4700)
(65 .7600 1.5750)
(70 .6300 1.6650)
(75 .5000 1.7350)
(80 .3650 1.7800)
(85 .2300 1.8000)
(90 .0900 1.8000)
(95 -.05 1.7800)
(100 -.1850 1.7500)
(105 -.3200 1.7000)
(110 -.4500 1.6350)
(115 -.5750 1.5550)
(120 -.6700 1.4650)
(125 -.7600 1.3500)
(130 -.8500 1.2250)
(135 -.9300 1.0850)
(140 -.9800 .9250)
(145 -.9000 .7550)
(150 -.7700 .5750)
(155 -.6700 .4200)
(160 -.6350 .3200)
(165 -.6800 .2300)
(170 -.8500 .1400)
(175 -.6600 .0550)
(180 0.000 .0250)