contSpoilTurb3D/constant/airfoils/NACA0018_8e4
// From Sheldahl and Klimas (1981)
// Re = 8e4
// (alpha_deg cl cd)
(-180	0	0.0250000000000000)
(-175	0.660000000000000	0.0550000000000000)
(-170	0.850000000000000	0.140000000000000)
(-165	0.680000000000000	0.230000000000000)
(-160	0.635000000000000	0.320000000000000)
(-155	0.670000000000000	0.420000000000000)
(-150	0.770000000000000	0.575000000000000)
(-145	0.900000000000000	0.755000000000000)
(-140	0.980000000000000	0.925000000000000)
(-135	0.930000000000000	1.08500000000000)
(-130	0.850000000000000	1.22500000000000)
(-125	0.760000000000000	1.35000000000000)
(-120	0.670000000000000	1.46500000000000)
(-115	0.575000000000000	1.55500000000000)
(-110	0.450000000000000	1.63500000000000)
(-105	0.320000000000000	1.70000000000000)
(-100	0.185000000000000	1.75000000000000)
(-95	0.0500000000000000	1.78000000000000)
(-90	-0.0900000000000000	1.80000000000000)
(-85	-0.230000000000000	1.80000000000000)
(-80	-0.365000000000000	1.78000000000000)
(-75	-0.500000000000000	1.73500000000000)
(-70	-0.630000000000000	1.66500000000000)
(-65	-0.760000000000000	1.57500000000000)
(-60	-0.875000000000000	1.47000000000000)
(-55	-0.955000000000000	1.34500000000000)
(-50	-1.02000000000000	1.21500000000000)
(-45	-1.05000000000000	1.07500000000000)
(-40	-1.03500000000000	0.920000000000000)
(-35	-0.980000000000000	0.745000000000000)
(-30	-0.855000000000000	0.570000000000000)
(-25	-0.596300000000000	0.405000000000000)
(-22	-0.443000000000000	0.329000000000000)
(-20	-0.347200000000000	0.282000000000000)
(-18	-0.260300000000000	0.238000000000000)
(-16	-0.202700000000000	0.196000000000000)
(-14	-0.225600000000000	0.158000000000000)
(-12	-0.440800000000000	0.0800000000000000)
(-11	-0.553100000000000	0.0315000000000000)
(-10	-0.624800000000000	0.0288000000000000)
(-9	-0.660600000000000	0.0264000000000000)
(-8	-0.658900000000000	0.0242000000000000)
(-7	-0.622400000000000	0.0223000000000000)
(-6	-0.561500000000000	0.0206000000000000)
(-5	-0.475300000000000	0.0192000000000000)
(-4	-0.388000000000000	0.0181000000000000)
(-3	-0.292400000000000	0.0172000000000000)
(-2	-0.193500000000000	0.0167000000000000)
(-1	-0.0889000000000000	0.0163000000000000)
(0 0.000 .0162)
(1 .0889 .0163)
(2 .1935 .0167)
(3 .2924 .0172)
(4 .3880 .0181)
(5 .4753 .0192)
(6 .5615 .0206)
(7 .6224 .0223)
(8 .6589 .0242)
(9 .6606 .0264)
(10 .6248 .0288)
(11 .5531 .0315)
(12 .4408 .0800)
(14 .2256 .1580)
(16 .2027 .1960)
(18 .2603 .2380)
(20 .3472 .2820)
(22 .4430 .3290)
(25 .5963 .4050)
(30 .8550 .5700)
(35 .9800 .7450)
(40 1.0350 .9200)
(45 1.0500 1.0750)
(50 1.0200 1.2150)
(55 .9550 1.3450)
(60 .8750 1.4700)
(65 .7600 1.5750)
(70 .6300 1.6650)
(75 .5000 1.7350)
(80 .3650 1.7800)
(85 .2300 1.8000)
(90 .0900 1.8000)
(95 -.05 1.7800)
(100 -.1850 1.7500)
(105 -.3200 1.7000)
(110 -.4500 1.6350)
(115 -.5750 1.5550)
(120 -.6700 1.4650)
(125 -.7600 1.3500)
(130 -.8500 1.2250)
(135 -.9300 1.0850)
(140 -.9800 .9250)
(145 -.9000 .7550)
(150 -.7700 .5750)
(155 -.6700 .4200)
(160 -.6350 .3200)
(165 -.6800 .2300)
(170 -.8500 .1400)
(175 -.6600 .0550)
(180 0.000 .0250)