contSpoilTurb3D/constant/airfoils/NACA0018_multiRe_Re
// List of Re
80000 160000 360000 700000 1000000