contSpoilTurb3D/constant/airfoils/NACA0018_multiRe_cd
// From Sheldahl and Klimas (1981)
// List of Re
//80000 160000 360000 700000 1000000
(-180	0.0250000000000000	0.0250000000000000	0.0250000000000000	0.0250000000000000	0.0250000000000000)
(-175	0.0550000000000000	0.0550000000000000	0.0550000000000000	0.0550000000000000	0.0550000000000000)
(-170	0.140000000000000	0.140000000000000	0.140000000000000	0.140000000000000	0.140000000000000)
(-165	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000)
(-160	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000)
(-155	0.420000000000000	0.420000000000000	0.420000000000000	0.420000000000000	0.420000000000000)
(-150	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000)
(-145	0.755000000000000	0.755000000000000	0.755000000000000	0.755000000000000	0.755000000000000)
(-140	0.925000000000000	0.925000000000000	0.925000000000000	0.925000000000000	0.925000000000000)
(-135	1.08500000000000	1.08500000000000	1.08500000000000	1.08500000000000	1.08500000000000)
(-130	1.22500000000000	1.22500000000000	1.22500000000000	1.22500000000000	1.22500000000000)
(-125	1.35000000000000	1.35000000000000	1.35000000000000	1.35000000000000	1.35000000000000)
(-120	1.46500000000000	1.46500000000000	1.46500000000000	1.46500000000000	1.46500000000000)
(-115	1.55500000000000	1.55500000000000	1.55500000000000	1.55500000000000	1.55500000000000)
(-110	1.63500000000000	1.63500000000000	1.63500000000000	1.63500000000000	1.63500000000000)
(-105	1.70000000000000	1.70000000000000	1.70000000000000	1.70000000000000	1.70000000000000)
(-100	1.75000000000000	1.75000000000000	1.75000000000000	1.75000000000000	1.75000000000000)
(-95	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000)
(-90	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000)
(-85	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000)
(-80	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000)
(-75	1.73500000000000	1.73500000000000	1.73500000000000	1.73500000000000	1.73500000000000)
(-70	1.66500000000000	1.66500000000000	1.66500000000000	1.66500000000000	1.66500000000000)
(-65	1.57500000000000	1.57500000000000	1.57500000000000	1.57500000000000	1.57500000000000)
(-60	1.47000000000000	1.47000000000000	1.47000000000000	1.47000000000000	1.47000000000000)
(-55	1.34500000000000	1.34500000000000	1.34500000000000	1.34500000000000	1.34500000000000)
(-50	1.21500000000000	1.21500000000000	1.21500000000000	1.21500000000000	1.21500000000000)
(-45	1.07500000000000	1.07500000000000	1.07500000000000	1.07500000000000	1.07500000000000)
(-40	0.920000000000000	0.920000000000000	0.920000000000000	0.920000000000000	0.920000000000000)
(-35	0.745000000000000	0.745000000000000	0.745000000000000	0.745000000000000	0.745000000000000)
(-30	0.570000000000000	0.570000000000000	0.570000000000000	0.570000000000000	0.570000000000000)
(-25	0.405000000000000	0.405000000000000	0.405000000000000	0.405000000000000	0.405000000000000)
(-22	0.329000000000000	0.329000000000000	0.329000000000000	0.329000000000000	0.329000000000000)
(-20	0.282000000000000	0.282000000000000	0.282000000000000	0.282000000000000	0.282000000000000)
(-18	0.238000000000000	0.238000000000000	0.238000000000000	0.238000000000000	0.238000000000000)
(-16	0.196000000000000	0.196000000000000	0.196000000000000	0.196000000000000	0.108000000000000)
(-15	0.177000000000000	0.177000000000000	0.145000000000000	0.102000000000000	0.0251000000000000)
(-14	0.158000000000000	0.158000000000000	0.0940000000000000	0.0245000000000000	0.0227000000000000)
(-13	0.119000000000000	0.0770000000000000	0.0259000000000000	0.0223000000000000	0.0206000000000000)
(-12	0.0800000000000000	0.0288000000000000	0.0235000000000000	0.0202000000000000	0.0187000000000000)
(-11	0.0315000000000000	0.0262000000000000	0.0213000000000000	0.0183000000000000	0.0170000000000000)
(-10	0.0288000000000000	0.0238000000000000	0.0194000000000000	0.0166000000000000	0.0154000000000000)
(-9	0.0264000000000000	0.0217000000000000	0.0176000000000000	0.0150000000000000	0.0139000000000000)
(-8	0.0242000000000000	0.0198000000000000	0.0159000000000000	0.0136000000000000	0.0126000000000000)
(-7	0.0223000000000000	0.0181000000000000	0.0145000000000000	0.0123000000000000	0.0115000000000000)
(-6	0.0206000000000000	0.0166000000000000	0.0132000000000000	0.0112000000000000	0.0102000000000000)
(-5	0.0192000000000000	0.0153000000000000	0.0121000000000000	0.0102000000000000	0.00950000000000000)
(-4	0.0181000000000000	0.0144000000000000	0.0112000000000000	0.00960000000000000	0.00890000000000000)
(-3	0.0172000000000000	0.0137000000000000	0.0107000000000000	0.00910000000000000	0.00860000000000000)
(-2	0.0167000000000000	0.0131000000000000	0.0104000000000000	0.00880000000000000	0.00830000000000000)
(-1	0.0163000000000000	0.0129000000000000	0.0102000000000000	0.00870000000000000	0.00820000000000000)
(0	0.0162000000000000	0.0128000000000000	0.0101000000000000	0.00850000000000000	0.00820000000000000)
(1	0.0163000000000000	0.0129000000000000	0.0102000000000000	0.00870000000000000	0.00820000000000000)
(2	0.0167000000000000	0.0131000000000000	0.0104000000000000	0.00880000000000000	0.00830000000000000)
(3	0.0172000000000000	0.0137000000000000	0.0107000000000000	0.00910000000000000	0.00860000000000000)
(4	0.0181000000000000	0.0144000000000000	0.0112000000000000	0.00960000000000000	0.00890000000000000)
(5	0.0192000000000000	0.0153000000000000	0.0121000000000000	0.0102000000000000	0.00950000000000000)
(6	0.0206000000000000	0.0166000000000000	0.0132000000000000	0.0112000000000000	0.0102000000000000)
(7	0.0223000000000000	0.0181000000000000	0.0145000000000000	0.0123000000000000	0.0115000000000000)
(8	0.0242000000000000	0.0198000000000000	0.0159000000000000	0.0136000000000000	0.0126000000000000)
(9	0.0264000000000000	0.0217000000000000	0.0176000000000000	0.0150000000000000	0.0139000000000000)
(10	0.0288000000000000	0.0238000000000000	0.0194000000000000	0.0166000000000000	0.0154000000000000)
(11	0.0315000000000000	0.0262000000000000	0.0213000000000000	0.0183000000000000	0.0170000000000000)
(12	0.0800000000000000	0.0288000000000000	0.0235000000000000	0.0202000000000000	0.0187000000000000)
(13	0.119000000000000	0.0770000000000000	0.0259000000000000	0.0223000000000000	0.0206000000000000)
(14	0.158000000000000	0.158000000000000	0.0940000000000000	0.0245000000000000	0.0227000000000000)
(15	0.177000000000000	0.177000000000000	0.145000000000000	0.102000000000000	0.0251000000000000)
(16	0.196000000000000	0.196000000000000	0.196000000000000	0.196000000000000	0.108000000000000)
(18	0.238000000000000	0.238000000000000	0.238000000000000	0.238000000000000	0.238000000000000)
(20	0.282000000000000	0.282000000000000	0.282000000000000	0.282000000000000	0.282000000000000)
(22	0.329000000000000	0.329000000000000	0.329000000000000	0.329000000000000	0.329000000000000)
(25	0.405000000000000	0.405000000000000	0.405000000000000	0.405000000000000	0.405000000000000)
(30	0.570000000000000	0.570000000000000	0.570000000000000	0.570000000000000	0.570000000000000)
(35	0.745000000000000	0.745000000000000	0.745000000000000	0.745000000000000	0.745000000000000)
(40	0.920000000000000	0.920000000000000	0.920000000000000	0.920000000000000	0.920000000000000)
(45	1.07500000000000	1.07500000000000	1.07500000000000	1.07500000000000	1.07500000000000)
(50	1.21500000000000	1.21500000000000	1.21500000000000	1.21500000000000	1.21500000000000)
(55	1.34500000000000	1.34500000000000	1.34500000000000	1.34500000000000	1.34500000000000)
(60	1.47000000000000	1.47000000000000	1.47000000000000	1.47000000000000	1.47000000000000)
(65	1.57500000000000	1.57500000000000	1.57500000000000	1.57500000000000	1.57500000000000)
(70	1.66500000000000	1.66500000000000	1.66500000000000	1.66500000000000	1.66500000000000)
(75	1.73500000000000	1.73500000000000	1.73500000000000	1.73500000000000	1.73500000000000)
(80	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000)
(85	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000)
(90	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000	1.80000000000000)
(95	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000	1.78000000000000)
(100	1.75000000000000	1.75000000000000	1.75000000000000	1.75000000000000	1.75000000000000)
(105	1.70000000000000	1.70000000000000	1.70000000000000	1.70000000000000	1.70000000000000)
(110	1.63500000000000	1.63500000000000	1.63500000000000	1.63500000000000	1.63500000000000)
(115	1.55500000000000	1.55500000000000	1.55500000000000	1.55500000000000	1.55500000000000)
(120	1.46500000000000	1.46500000000000	1.46500000000000	1.46500000000000	1.46500000000000)
(125	1.35000000000000	1.35000000000000	1.35000000000000	1.35000000000000	1.35000000000000)
(130	1.22500000000000	1.22500000000000	1.22500000000000	1.22500000000000	1.22500000000000)
(135	1.08500000000000	1.08500000000000	1.08500000000000	1.08500000000000	1.08500000000000)
(140	0.925000000000000	0.925000000000000	0.925000000000000	0.925000000000000	0.925000000000000)
(145	0.755000000000000	0.755000000000000	0.755000000000000	0.755000000000000	0.755000000000000)
(150	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000)
(155	0.420000000000000	0.420000000000000	0.420000000000000	0.420000000000000	0.420000000000000)
(160	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000)
(165	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000)
(170	0.140000000000000	0.140000000000000	0.140000000000000	0.140000000000000	0.140000000000000)
(175	0.0550000000000000	0.0550000000000000	0.0550000000000000	0.0550000000000000	0.0550000000000000)
(180	0.0250000000000000	0.0250000000000000	0.0250000000000000	0.0250000000000000	0.0250000000000000)