contSpoilTurb3D/constant/airfoils/NACA0018_multiRe_cl
// From Sheldahl and Klimas (1981)
// List of Re
//80000 160000 360000 700000 1000000
(-180	0	0	0	0	0)
(-175	0.660000000000000	0.660000000000000	0.660000000000000	0.660000000000000	0.660000000000000)
(-170	0.850000000000000	0.850000000000000	0.850000000000000	0.850000000000000	0.850000000000000)
(-165	0.680000000000000	0.680000000000000	0.680000000000000	0.680000000000000	0.680000000000000)
(-160	0.635000000000000	0.635000000000000	0.635000000000000	0.635000000000000	0.635000000000000)
(-155	0.670000000000000	0.670000000000000	0.670000000000000	0.670000000000000	0.670000000000000)
(-150	0.770000000000000	0.770000000000000	0.770000000000000	0.770000000000000	0.770000000000000)
(-145	0.900000000000000	0.900000000000000	0.900000000000000	0.900000000000000	0.900000000000000)
(-140	0.980000000000000	0.980000000000000	0.980000000000000	0.980000000000000	0.980000000000000)
(-135	0.930000000000000	0.930000000000000	0.930000000000000	0.930000000000000	0.930000000000000)
(-130	0.850000000000000	0.850000000000000	0.850000000000000	0.850000000000000	0.850000000000000)
(-125	0.760000000000000	0.760000000000000	0.760000000000000	0.760000000000000	0.760000000000000)
(-120	0.670000000000000	0.670000000000000	0.670000000000000	0.670000000000000	0.670000000000000)
(-115	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000	0.575000000000000)
(-110	0.450000000000000	0.450000000000000	0.450000000000000	0.450000000000000	0.450000000000000)
(-105	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000	0.320000000000000)
(-100	0.185000000000000	0.185000000000000	0.185000000000000	0.185000000000000	0.185000000000000)
(-95	0.0500000000000000	0.0500000000000000	0.0500000000000000	0.0500000000000000	0.0500000000000000)
(-90	-0.0900000000000000	-0.0900000000000000	-0.0900000000000000	-0.0900000000000000	-0.0900000000000000)
(-85	-0.230000000000000	-0.230000000000000	-0.230000000000000	-0.230000000000000	-0.230000000000000)
(-80	-0.365000000000000	-0.365000000000000	-0.365000000000000	-0.365000000000000	-0.365000000000000)
(-75	-0.500000000000000	-0.500000000000000	-0.500000000000000	-0.500000000000000	-0.500000000000000)
(-70	-0.630000000000000	-0.630000000000000	-0.630000000000000	-0.630000000000000	-0.630000000000000)
(-65	-0.760000000000000	-0.760000000000000	-0.760000000000000	-0.760000000000000	-0.760000000000000)
(-60	-0.875000000000000	-0.875000000000000	-0.875000000000000	-0.875000000000000	-0.875000000000000)
(-55	-0.955000000000000	-0.955000000000000	-0.955000000000000	-0.955000000000000	-0.955000000000000)
(-50	-1.02000000000000	-1.02000000000000	-1.02000000000000	-1.02000000000000	-1.02000000000000)
(-45	-1.05000000000000	-1.05000000000000	-1.05000000000000	-1.05000000000000	-1.05000000000000)
(-40	-1.03500000000000	-1.03500000000000	-1.03500000000000	-1.03500000000000	-1.03500000000000)
(-35	-0.980000000000000	-0.980000000000000	-0.980000000000000	-0.980000000000000	-0.980000000000000)
(-30	-0.855000000000000	-0.855000000000000	-0.855000000000000	-0.855000000000000	-0.855000000000000)
(-25	-0.596300000000000	-0.632100000000000	-0.772400000000000	-0.932600000000000	-1.01070000000000)
(-22	-0.443000000000000	-0.502600000000000	-0.705000000000000	-0.886700000000000	-0.969600000000000)
(-20	-0.347200000000000	-0.438200000000000	-0.699700000000000	-0.887700000000000	-0.970700000000000)
(-18	-0.260300000000000	-0.420200000000000	-0.731900000000000	-0.915000000000000	-0.995900000000000)
(-16	-0.202700000000000	-0.489600000000000	-0.800700000000000	-0.964800000000000	-1.04020000000000)
(-15	-0.214200000000000	-0.556700000000000	-0.840500000000000	-0.993800000000000	-1.06240000000000)
(-14	-0.225600000000000	-0.623700000000000	-0.880300000000000	-1.01750000000000	-1.07930000000000)
(-13	-0.333200000000000	-0.692300000000000	-0.910400000000000	-1.02890000000000	-1.08040000000000)
(-12	-0.440800000000000	-0.748800000000000	-0.927900000000000	-1.02450000000000	-1.06640000000000)
(-11	-0.553100000000000	-0.785200000000000	-0.924900000000000	-0.997300000000000	-1.02840000000000)
(-10	-0.624800000000000	-0.794900000000000	-0.898300000000000	-0.954100000000000	-0.974100000000000)
(-9	-0.660600000000000	-0.778100000000000	-0.852600000000000	-0.890400000000000	-0.906700000000000)
(-8	-0.658900000000000	-0.737300000000000	-0.787900000000000	-0.815600000000000	-0.825600000000000)
(-7	-0.622400000000000	-0.672400000000000	-0.710000000000000	-0.729100000000000	-0.736200000000000)
(-6	-0.561500000000000	-0.596000000000000	-0.662800000000000	-0.632800000000000	-0.660000000000000)
(-5	-0.475300000000000	-0.506800000000000	-0.524000000000000	-0.550000000000000	-0.550000000000000)
(-4	-0.388000000000000	-0.411400000000000	-0.440000000000000	-0.440000000000000	-0.440000000000000)
(-3	-0.292400000000000	-0.308800000000000	-0.330000000000000	-0.330000000000000	-0.330000000000000)
(-2	-0.193500000000000	-0.220000000000000	-0.220000000000000	-0.220000000000000	-0.220000000000000)
(-1	-0.0889000000000000	-0.110000000000000	-0.110000000000000	-0.110000000000000	-0.110000000000000)
(0	0	0	0	0	0)
(1	0.0889000000000000	0.110000000000000	0.110000000000000	0.110000000000000	0.110000000000000)
(2	0.193500000000000	0.220000000000000	0.220000000000000	0.220000000000000	0.220000000000000)
(3	0.292400000000000	0.308800000000000	0.330000000000000	0.330000000000000	0.330000000000000)
(4	0.388000000000000	0.411400000000000	0.440000000000000	0.440000000000000	0.440000000000000)
(5	0.475300000000000	0.506800000000000	0.524000000000000	0.550000000000000	0.550000000000000)
(6	0.561500000000000	0.596000000000000	0.662800000000000	0.632800000000000	0.660000000000000)
(7	0.622400000000000	0.672400000000000	0.710000000000000	0.729100000000000	0.736200000000000)
(8	0.658900000000000	0.737300000000000	0.787900000000000	0.815600000000000	0.825600000000000)
(9	0.660600000000000	0.778100000000000	0.852600000000000	0.890400000000000	0.906700000000000)
(10	0.624800000000000	0.794900000000000	0.898300000000000	0.954100000000000	0.974100000000000)
(11	0.553100000000000	0.785200000000000	0.924900000000000	0.997300000000000	1.02840000000000)
(12	0.440800000000000	0.748800000000000	0.927900000000000	1.02450000000000	1.06640000000000)
(13	0.333200000000000	0.692300000000000	0.910400000000000	1.02890000000000	1.08040000000000)
(14	0.225600000000000	0.623700000000000	0.880300000000000	1.01750000000000	1.07930000000000)
(15	0.214200000000000	0.556700000000000	0.840500000000000	0.993800000000000	1.06240000000000)
(16	0.202700000000000	0.489600000000000	0.800700000000000	0.964800000000000	1.04020000000000)
(18	0.260300000000000	0.420200000000000	0.731900000000000	0.915000000000000	0.995900000000000)
(20	0.347200000000000	0.438200000000000	0.699700000000000	0.887700000000000	0.970700000000000)
(22	0.443000000000000	0.502600000000000	0.705000000000000	0.886700000000000	0.969600000000000)
(25	0.596300000000000	0.632100000000000	0.772400000000000	0.932600000000000	1.01070000000000)
(30	0.855000000000000	0.855000000000000	0.855000000000000	0.855000000000000	0.855000000000000)
(35	0.980000000000000	0.980000000000000	0.980000000000000	0.980000000000000	0.980000000000000)
(40	1.03500000000000	1.03500000000000	1.03500000000000	1.03500000000000	1.03500000000000)
(45	1.05000000000000	1.05000000000000	1.05000000000000	1.05000000000000	1.05000000000000)
(50	1.02000000000000	1.02000000000000	1.02000000000000	1.02000000000000	1.02000000000000)
(55	0.955000000000000	0.955000000000000	0.955000000000000	0.955000000000000	0.955000000000000)
(60	0.875000000000000	0.875000000000000	0.875000000000000	0.875000000000000	0.875000000000000)
(65	0.760000000000000	0.760000000000000	0.760000000000000	0.760000000000000	0.760000000000000)
(70	0.630000000000000	0.630000000000000	0.630000000000000	0.630000000000000	0.630000000000000)
(75	0.500000000000000	0.500000000000000	0.500000000000000	0.500000000000000	0.500000000000000)
(80	0.365000000000000	0.365000000000000	0.365000000000000	0.365000000000000	0.365000000000000)
(85	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000	0.230000000000000)
(90	0.0900000000000000	0.0900000000000000	0.0900000000000000	0.0900000000000000	0.0900000000000000)
(95	-0.0500000000000000	-0.0500000000000000	-0.0500000000000000	-0.0500000000000000	-0.0500000000000000)
(100	-0.185000000000000	-0.185000000000000	-0.185000000000000	-0.185000000000000	-0.185000000000000)
(105	-0.320000000000000	-0.320000000000000	-0.320000000000000	-0.320000000000000	-0.320000000000000)
(110	-0.450000000000000	-0.450000000000000	-0.450000000000000	-0.450000000000000	-0.450000000000000)
(115	-0.575000000000000	-0.575000000000000	-0.575000000000000	-0.575000000000000	-0.575000000000000)
(120	-0.670000000000000	-0.670000000000000	-0.670000000000000	-0.670000000000000	-0.670000000000000)
(125	-0.760000000000000	-0.760000000000000	-0.760000000000000	-0.760000000000000	-0.760000000000000)
(130	-0.850000000000000	-0.850000000000000	-0.850000000000000	-0.850000000000000	-0.850000000000000)
(135	-0.930000000000000	-0.930000000000000	-0.930000000000000	-0.930000000000000	-0.930000000000000)
(140	-0.980000000000000	-0.980000000000000	-0.980000000000000	-0.980000000000000	-0.980000000000000)
(145	-0.900000000000000	-0.900000000000000	-0.900000000000000	-0.900000000000000	-0.900000000000000)
(150	-0.770000000000000	-0.770000000000000	-0.770000000000000	-0.770000000000000	-0.770000000000000)
(155	-0.670000000000000	-0.670000000000000	-0.670000000000000	-0.670000000000000	-0.670000000000000)
(160	-0.635000000000000	-0.635000000000000	-0.635000000000000	-0.635000000000000	-0.635000000000000)
(165	-0.680000000000000	-0.680000000000000	-0.680000000000000	-0.680000000000000	-0.680000000000000)
(170	-0.850000000000000	-0.850000000000000	-0.850000000000000	-0.850000000000000	-0.850000000000000)
(175	-0.660000000000000	-0.660000000000000	-0.660000000000000	-0.660000000000000	-0.660000000000000)
(180	0	0	0	0	0)